[Language]
1=English
2=YED Test Tools V{0}

1000=Software startup in progress
1001=Sending:
1002=Receiving:
1003=Timestamp
1004=Timed automatic sending
1005=File association
1006=Hexadecimal
1007=Pause receive
1008=Empty send area
1009=Empty receive area
1010=Communication parameters
1011=Send
1012=Hexadecimal
1013=Send area function
1014=Disconnect
1015=Connect
1016=Input dialog box
1017=OK
1018=Cancel
1019=Please enter timed auto send interval in milliseconds.
1020=File
1021=Link Management
1022=Tools
1023=Language
1024=Get Information
1025=General Settings
1026=Language has been switched, restart the software to take effect!

1027=Communication interface type
1028=Character encoding format
1029=Packet timeout
1030=Milliseconds
1031=Auto connect

1032=Serial port
1033=Serial port number
1034=Refresh serial port
1035=Baud rate
1036=Data bits
1037=Stop bit
1038=Check Bit
1039=Flow control
1040=RTS
1041=DTR

1042=Serial communication
1043=TCP Client
1044=TCP server
1045=UDP
1046=MQTT Client

1047=OK
1048=Connect to serial port {0} Failed, please check if the serial port connection is normal, whether it is occupied by other processes.
1049=Hex
1050=String
1051=File
1052=File does not exist, please check if the file path is correct.
1053=Please select the serial port you want to connect.
1054=Please check the data you want to send cyclically.
1055=Save successfully
1056=Save failed
1057=Please add command data first.
1058=Are you sure you want to delete?
1059=Failed to open project file
1060=Command data has been detected in the list, but it will be cleared after creating a new project, are you sure you want to create a new command project?

1061=Please edit the code first.
1062=Code and variables are detected, code and variables will be cleared after creating a new project, are you sure you want to create a new script code project?
1063=Are you sure you want to clear the variables?
1064=Are you sure you want to clear variable data?
1065=Are you sure you want to clear the log?
1066=Insufficient privileges, please run the software with administrator privileges before performing the file format association operation!
1067=Yinda Serial Debugging Tool Command Project File
1068=Set the associated file format successfully.
1069=Failed to set file format association.
1070=Cancel file format association completed
1071=YINERDA Serial Debugging Tool Lua script project file.
1072=Are you sure you want to quit the software?

1073=Project
1074=Open Project
1075=Delete Project
1076=Open project directory
1077=Open project in new window
1078=Refresh list
1079=Expand all
1080=Shrink all
1081=Select Project
1082=Associate file format
1083=Cancel file format association
1084=Exit software
1085=Unsupported file formats
1086=New Project
1087=Save
1088=Save as
1089=Loop send
1090=Stop loop
1091=Send
1092=Name
1093=Format
1094=Data
1095=Delay (ms)
1096=Check
1097=Up
1098=Down
1099=Del
1100=Run Code
1101=Stop running
1102=Empty variables
1103=Empty data
1104=Variable name
1105=Variable data
1106=Variable monitoring
1107=Code Editor
1108=Run Log
1109=Start Printing
1110=Stop Printing
1111=Empty Log
1112=Quick command
1113=Lua Script
1114=Prompt
1115=Please enter the code to be run
1116=Please enter content
1117=OK
1118=Cancel
1119=Enter dialog box
1120=Please enter the address of the server to which you want to connect.
1121=Please enter the port of the server to which you want to connect.
1122=Enter wrong IP address
1123=Connection to server {0} failed
1124=Enter wrong remote IP address
1125=Please enter a server port to listen on.
1126=Listen on port {0} failed
1127=This feature is not supported
1128=Reception area function
1129=Window top
1130=View
1131=Append line feed at end
1132=IP address
1133=Port number
1134=Server port number
1135=Target Address
1136=Target port
1137=Please enter the name of the LUA variable to be monitored.
1138=The variable already exists in the list.
1139=Are you sure you want to delete the variable?
1140=Description
1141=Allow editing
1142=Disable editing
1143=Select communication object
1144=URL address
1145=Save to file
1146=Stop
1147=Log save directory
1148=Automatically save log
1149=Open Log Directory
1150=Select Directory
1151=Delete blank char
1152=Communication link
1153=Carriage return line feed mode
1154=Prevent System Hibernation and Screen Hibernation
1155=General
1156=Log
1157=Communication object selection
1158=Default load path for project
1159=Open Directory
1160=Select Catalog
1161=Select project directory
1162=Not connected
1163=Error in hexadecimal data entry
1164=Please connect first
1165=Support connection with domain name or IP address
1166=All NICs
1167=Specify the listening NIC
1168=Refresh NIC
1169=Local port number
1170=Please enter the destination address
1171=Please enter the destination port
1172=Please enter the local port number to listen on.
1173=Connect all
1174=String
1175=String/Hexadecimal
1176=Connection established successfully
1177=Disconnected.
1178=New connection coming in {0}
1179=Disconnected {0}
1180=Function switch
1181=Please unzip the software into a folder and run it.
1182=Working environment data is missing, please reinstall the software.
1183=Copy content
1184=Mark selected content background color
1185=Clear background color of selection
1186=Missing ICON icon, please reinstall the software.
1187=Format hexadecimal text
1188=No matches found
1189=Search for content
1190=Case sensitive
1191=Search
1192=Add
1193=Search All
1194=Serial number
1195=Match content
1196=Automatic line feed
1197=Batch mark selected content background color
1198=Clear background color of selected content in batch
1199=Clear all markers background color
1200=Are you sure you want to perform a Clear All Markers background color operation?
1201=Sure you want to quit the software?
1202=Length:
1203=Byte:
1204=Copy content in tabular format
1205=Recently opened project
1206=Clear recently opened records
1207=Analysis of data results


calc.bat=Calculator
notepad.bat=Notepad
devicemanager.bat=Device manager